In [ ]:
import numpy as np
import pandas as pd

### Exercise 4.1.1

In [ ]:
s1 = pd.Series([1, 3, 6], index = ['a', 'b', 'c'])
s2 = pd.Series([2, 4, 5], index = ['a', 'b', 'd'])

In [ ]:
s1 + s2

a    3.0
b    7.0
c    NaN
d    NaN
dtype: float64

In [ ]:
s1 * s2

a     2.0
b    12.0
c     NaN
d     NaN
dtype: float64

In [ ]:
s1 - s2

a   -1.0
b   -1.0
c    NaN
d    NaN
dtype: float64

In [ ]:
s1 / s2

a    0.50
b    0.75
c     NaN
d     NaN
dtype: float64

### Exercise 4.1.2

In [ ]:
pd.DataFrame({
    'int1' : [1, 2, 3, 4, 5],
    'int2' : [10, 20, 30, 40, 50],
    'int3' : [100, 200, 300, 400, 500],
    'string' : ['a', 'b', 'c', 'd', 'e'],
    'float' : [3.14, 1.414, 1.732, 2.718, 2.235]
})

   int1  int2  int3 string  float
0     1    10   100      a  3.140
1     2    20   200      b  1.414
2     3    30   300      c  1.732
3     4    40   400      d  2.718
4     5    50   500      e  2.235

### Exercise 4.1.3

In [ ]:
data = {
    '국어' : [80, 90, 70, 30],
    '영어' : [90, 70, 60, 40],
    '수학' : [90, 60, 80, 70],
}
columns = ['국어', '영어', '수학']
index = ['춘향', '몽룡', '향단', '방자']
df = pd.DataFrame(data, index = index, columns = columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [ ]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [ ]:
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [ ]:
df['평균'] = np.round(df.mean(axis = 1), 2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [ ]:
del df['평균']
df['영어'][3] = 80
df['평균'] = np.round(df.mean(axis = 1), 2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [ ]:
df[:'춘향']

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [ ]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

### Exercise 4.3.1

In [ ]:
np.random.seed(2021)
df = pd.DataFrame(np.random.randint(1, 100, 25).reshape(5, 5),
                  index = ['a', 'b', 'c', 'd', 'e'],
                  columns = ['v', 'w', 'x', 'y', 'z'])
df

    v   w   x   y   z
a  86  58   1  95  87
b  45  63  92  30  22
c  94  25  13  71  71
d  34   8   2  98  27
e  67  49  64  50  17

In [ ]:
df['w']['b'], df.w['b'], df.w[1], df.w.b

(63, 63, 63, 63)

In [ ]:
df.loc['b', 'w'], df.loc['b']['w'], df.loc['b'][1]

(63, 63, 63)

In [ ]:
df.iloc[1, 1], df.iloc[1][1], df.iloc[1]['w']

(63, 63, 63)

### Exercise 4.4.1

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### Exercise 4.4.2

In [ ]:
titanic.sex.value_counts().sort_values()

female    314
male      577
Name: sex, dtype: int64

In [ ]:
titanic.age.value_counts().sort_values()

0.42      1
20.50     1
24.50     1
0.67      1
14.50     1
         ..
30.00    25
19.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [ ]:
titanic['class'].value_counts().sort_values()

Second    184
First     216
Third     491
Name: class, dtype: int64

In [ ]:
titanic.alive.value_counts().sort_values()

yes    342
no     549
Name: alive, dtype: int64

### Exercise 4.4.3

In [ ]:
titanic.age.mean()

29.69911764705882

In [ ]:
titanic[titanic.sex == 'female'].age.mean()

27.915708812260537

In [ ]:
titanic.head(3)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True

[3 rows x 15 columns]

In [ ]:
dft = titanic[titanic.pclass == 1]
dft[dft.sex == 'female'].age.mean()

34.61176470588235

### Exercise 4.4.4

In [ ]:
titanic = sns.load_dataset('titanic')
titanic = titanic[['survived', 'pclass', 'sex', 'age']]

In [ ]:
import warnings
warnings.filterwarnings('ignore')

In [ ]:
titanic['category1'] = titanic.apply(
    lambda r: r.sex if r.age >= 20 else 'child', axis = 1
)
titanic.tail()

     survived  pclass     sex   age category1
886         0       2    male  27.0      male
887         1       1  female  19.0     child
888         0       3  female   NaN     child
889         1       1    male  26.0      male
890         0       3    male  32.0      male

### Exercise 4.4.5

In [ ]:
# titanic['age'] = titanic.age.fillna(np.round(titanic.age.mean()))
titanic.age.fillna(np.round(titanic.age.mean()), inplace = True)
titanic.tail()

     survived  pclass     sex   age category1
886         0       2    male  27.0      male
887         1       1  female  19.0     child
888         0       3  female  30.0     child
889         1       1    male  26.0      male
890         0       3    male  32.0      male

### Exercise 4.4.6

In [ ]:
titanic['catagory2'] = titanic.sex + titanic.age.astype(int).astype(str)
titanic.tail()

     survived  pclass     sex   age category1 catagory2
886         0       2    male  27.0      male    male27
887         1       1  female  19.0     child  female19
888         0       3  female  30.0     child  female30
889         1       1    male  26.0      male    male26
890         0       3    male  32.0      male    male32

### Exercise 4.4.7

In [ ]:
bins = [1, 20, 30, 50, 70, 100]
labels = ['미성년자', '청년', '중년', '장년', '노년']
cats = pd.cut(titanic.age.values, bins, labels = labels)
cats

['청년', '중년', '청년', '중년', '중년', ..., '청년', '미성년자', '청년', '청년', '중년']
Length: 891
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [ ]:
cats.value_counts()

미성년자    165
청년      407
중년      241
장년       59
노년        5
dtype: int64

In [ ]:
df = pd.DataFrame(cats.value_counts(), columns = ['인원수'])
df

      인원수
미성년자  165
청년    407
중년    241
장년     59
노년      5

In [ ]:
df['비율(%)'] = np.round(df['인원수'] / df['인원수'].sum() * 100, 2)
df

      인원수  비율(%)
미성년자  165  18.81
청년    407  46.41
중년    241  27.48
장년     59   6.73
노년      5   0.57

In [ ]:
df['비율(%)'].sum()

100.0

### Exercise 4.4.8

In [ ]:
titanic['group'] = pd.cut(titanic.age.values, bins, labels = labels)
titanic.tail()

     survived  pclass     sex   age category1 catagory2 group
886         0       2    male  27.0      male    male27    청년
887         1       1  female  19.0     child  female19  미성년자
888         0       3  female  30.0     child  female30    청년
889         1       1    male  26.0      male    male26    청년
890         0       3    male  32.0      male    male32    중년

In [ ]:
titanic['성별'] = titanic.apply(lambda r: '남성' if r.sex == 'male' else '여성', axis = 1)
titanic.tail()

     survived  pclass     sex   age category1 catagory2 group  성별
886         0       2    male  27.0      male    male27    청년  남성
887         1       1  female  19.0     child  female19  미성년자  여성
888         0       3  female  30.0     child  female30    청년  여성
889         1       1    male  26.0      male    male26    청년  남성
890         0       3    male  32.0      male    male32    중년  남성

In [ ]:
titanic['category3'] = titanic.apply(
    lambda r: r.group + r.성별 if r.age >= 20 else '미성년자', 
    axis=1
)
titanic.tail()

     survived  pclass     sex   age category1 catagory2 group  성별 category3
886         0       2    male  27.0      male    male27    청년  남성      청년남성
887         1       1  female  19.0     child  female19  미성년자  여성      미성년자
888         0       3  female  30.0     child  female30    청년  여성      청년여성
889         1       1    male  26.0      male    male26    청년  남성      청년남성
890         0       3    male  32.0      male    male32    중년  남성      중년남성

### Exercise 4.5.1

In [ ]:
np.random.seed(2021)
df_score1 = pd.DataFrame(np.random.randint(40, 100, 15).reshape(5, 3), 
                         columns = ['국어', '영어', '수학'])
df_score1.index = ['김판다', '이판다', '박판다', '최판다', '정판다']
df_score1.index.name = '이름'
df_score1

     국어  영어  수학
이름
김판다  92  61  97
이판다  40  85  70
박판다  62  84  67
최판다  69  61  69
정판다  64  52  94

In [ ]:
df_score2 = df_score1.reset_index()
df_score2

    이름  국어  영어  수학
0  김판다  92  61  97
1  이판다  40  85  70
2  박판다  62  84  67
3  최판다  69  61  69
4  정판다  64  52  94

In [ ]:
df_score2.set_index('이름')

     국어  영어  수학
이름
김판다  92  61  97
이판다  40  85  70
박판다  62  84  67
최판다  69  61  69
정판다  64  52  94